#+TITLE: music_helper todo's
#+DESCRIPTION: This is an exaustiv list of todo's for the music_helper solution
#+AUTHOR: Quentin Burgess quentin.burgess@frafos.com

This is the legendary SouSound ; release candidate 2

* Rasp support

- [ ] ensure deps work
- [ ] create services
- [ ] store logs (syslog ?)
- [ ] opt remove colors
- [ ] auto adb over tcp

* v1.2

** Enhancement [0/4] [0%]
*** TODO wrapper [0/1] [0%]
    - [ ] logging option
*** TODO sync [0/2] [0%]
    - [ ] cli add dir
      - [ ] cli rm dir
      - [ ] cli list dir
    - [ ] tcpip/usb option [0/3] [0%]
      - [ ] support tcpip
      - [ ] support usb
      - [ ] cli choice if none provide
*** IDEA a simple api to access the scirpt ? [0/2] [0%]
    - [ ] api
    - [ ] front api
      - [ ] music streamer
      - [ ] music browser


** a better doc [0/4] [0%]
*** TODO dl [0/3] [0%]
- [ ] args
- [ ] compat
- [ ] error management
*** TODO sync [0/3] [0%]
- [ ] args
- [ ] compat
- [ ] error management
*** TODO wrapper
*** IDEA quick start

* v1.1

** Enhancement [5/5] [100%]
*** DONE wrapper  [2/10] [20%]
    CLOSED: [2019-09-05 Thu 15:15]
    - [X] cli append url
    - [X] cli list url
*** DONE check version of the deps ?
    CLOSED: [2019-08-14 Wed 14:28]
*** DONE sync / dl locked by dir ?
    CLOSED: [2019-08-12 Mon 10:48]
*** DONE return value from workers handled ?
    CLOSED: [2019-08-12 Mon 10:48]

*** DONE dl [4/4] [100%]
    CLOSED: [2019-09-05 Thu 15:16]
    - [X] some cli management to comment / uncomment ?
    - [X] ctrl + c
    - [X] error if dl has some fail
    - [X] recap for number of file


** Fixes [1/1] [100%]
*** DONE sync [1/1] [100%]
    CLOSED: [2019-09-05 Thu 15:14]
    - [X] sync stop at the first file ..

* v1

** DONE dl utility [8/8] [100%]
   CLOSED: [2019-06-14 Fri 16:45]
   :LOGBOOK:
   CLOCK: [2019-06-14 Fri 15:40]--[2019-06-14 Fri 16:44] =>  1:04
   CLOCK: [2019-06-14 Fri 14:16]--[2019-06-14 Fri 14:40] =>  0:24
   :END:
- [X] cli params
- [X] conf files [3/3] [100%]
  - [X] yt
  - [X] dl
  - [X] ignore `#`
- [X] install if not
- [X] dl
- [X] waiter
- [X] read config file
- [X] logger
- [X] doc [2/2] [100%]
  - [X] conf file
  - [X] running


** DONE sync utility [8/8] [100%]
   CLOSED: [2019-08-12 Mon 10:47]
   :LOGBOOK:
   CLOCK: [2019-06-14 Fri 21:12]--[2019-06-14 Mon 23:12] =>  2:00
   CLOCK: [2019-06-14 Fri 16:55]--[2019-06-14 Fri 17:14] =>  0:19
   :END:
- [X] cli param [3/3] [100%]
  - [X] connect ip
  - [X] sync out path
  - [X] sync in path
- [X] conf file
- [X] install if not
- [X] connect : addr
- [X] sync
- [X] waiter ?
- [X] logger
- [X] doc
